tiborsimon/embedded-tdd-headers/pic/pic18/pic18f8680_tdd.h
#define RXB1D4                        3323
#define RXB1D40                       3324
#define RXB1D41                       3325
#define RXB1D42                       3326
#define RXB1D43                       3327
#define RXB1D44                       3328
#define RXB1D45                       3329
#define RXB1D46                       3330
#define RXB1D47                       3331
#define RXB1D5                        3332
#define RXB1D50                       3333
#define RXB1D51                       3334
#define RXB1D52                       3335
#define RXB1D53                       3336
#define RXB1D54                       3337
#define RXB1D55                       3338
#define RXB1D56                       3339
#define RXB1D57                       3340
#define RXB1D6                        3341
#define RXB1D60                       3342
#define RXB1D61                       3343
#define RXB1D62                       3344
#define RXB1D63                       3345
#define RXB1D64                       3346
#define RXB1D65                       3347
#define RXB1D66                       3348
#define RXB1D67                       3349
#define RXB1D7                        3350
#define RXB1D70                       3351
#define RXB1D71                       3352
#define RXB1D72                       3353
#define RXB1D73                       3354
#define RXB1D74                       3355
#define RXB1D75                       3356
#define RXB1D76                       3357
#define RXB1D77                       3358
#define CANSTAT_RO0                   3359
#define CANSTAT_RO0_EICODE0           3360
#define CANSTAT_RO0_EICODE1_ICODE0    3361
#define CANSTAT_RO0_EICODE2_ICODE1    3362
#define CANSTAT_RO0_EICODE3_ICODE2    3363
#define CANSTAT_RO0_EICODE4           3364
#define CANSTAT_RO0_OPMODE0           3365
#define CANSTAT_RO0_OPMODE1           3366
#define CANSTAT_RO0_OPMODE2           3367
#define CANCON_RO0                    3368
#define CANCON_RO0_FP0                3369
#define CANCON_RO0_WIN0_FP1           3370
#define CANCON_RO0_WIN1_FP2           3371
#define CANCON_RO0_WIN2_FP3           3372
#define CANCON_RO0_ABAT               3373
#define CANCON_RO0_REQOP0             3374
#define CANCON_RO0_REQOP1             3375
#define CANCON_RO0_REQOP2             3376
#define RXB0CON                       3377
#define RXB0CON_FILHIT0               3378
#define RXB0FILHIT0                   3379
#define JTOFF_FILHIT1                 3380
#define RXB0CON_FILHIT1               3381
#define RXB0FILHIT1                   3382
#define JTOFF                         3383
#define RXB0DBEN_FILHIT2              3384
#define RXB0DBEN                      3385
#define RXB0FILHIT2                   3386
#define RXB0CON_FILHIT2               3387
#define RXB0CON_RXRTRRO               3388
#define RXB0FILHIT3                   3389
#define RXB0CON_RTRRO_FILHIT3         3390
#define RXB0CON_RXRTRRO_FILHIT3       3391
#define RXB0CON_FILHIT3               3392
#define RXB0RTRR0                     3393
#define RXB0CON_FILHIT4               3394
#define RXB0FILHIT4                   3395
#define RXB0RTRRO                     3396
#define RXB0CON_RXM0_RTRRO            3397
#define RXB0M0                        3398
#define RTRR0                         3399
#define RXB0CON_RTRRO                 3400
#define RXB0CON_RXM0                  3401
#define RXB0M1                        3402
#define RXB0CON_RXM1                  3403
#define RXB0FUL                       3404
#define RXB0CON_RXFUL                 3405
#define RXB0SIDH                      3406
#define RXB0SIDH_SID3                 3407
#define RXB0SID3                      3408
#define RXB0SIDH_SID4                 3409
#define RXB0SID4                      3410
#define RXB0SIDH_SID5                 3411
#define RXB0SID5                      3412
#define RXB0SIDH_SID6                 3413
#define RXB0SID6                      3414
#define RXB0SIDH_SID7                 3415
#define RXB0SID7                      3416
#define RXB0SIDH_SID8                 3417
#define RXB0SID8                      3418
#define RXB0SIDH_SID9                 3419
#define RXB0SID9                      3420
#define RXB0SIDH_SID10                3421
#define RXB0SID10                     3422
#define RXB0SIDL                      3423
#define RXB0SIDL_EID16                3424
#define RXB0EID16                     3425
#define RXB0SIDL_EID17                3426
#define RXB0EID17                     3427
#define RXB0EXID                      3428
#define RXB0SIDL_EXID                 3429
#define RXB0SRR                       3430
#define RXB0SIDL_SRR                  3431
#define RXB0SID0                      3432
#define RXB0SIDL_SID0                 3433
#define RXB0SID1                      3434
#define RXB0SIDL_SID1                 3435
#define RXB0SIDL_SID2                 3436
#define RXB0SID2                      3437
#define RXB0EIDH                      3438
#define RXB0EID8                      3439
#define RXB0EIDH_EID8                 3440
#define RXB0EID9                      3441
#define RXB0EIDH_EID9                 3442
#define RXB0EID10                     3443
#define RXB0EIDH_EID10                3444
#define RXB0EID11                     3445
#define RXB0EIDH_EID11                3446
#define RXB0EID12                     3447
#define RXB0EIDH_EID12                3448
#define RXB0EID13                     3449
#define RXB0EIDH_EID13                3450
#define RXB0EID14                     3451
#define RXB0EIDH_EID14                3452
#define RXB0EID15                     3453
#define RXB0EIDH_EID15                3454
#define RXB0EIDL                      3455
#define RXB0EID0                      3456
#define RXB0EIDL_EID0                 3457
#define RXB0EID1                      3458
#define RXB0EIDL_EID1                 3459
#define RXB0EID2                      3460
#define RXB0EIDL_EID2                 3461
#define RXB0EID3                      3462
#define RXB0EIDL_EID3                 3463
#define RXB0EID4                      3464
#define RXB0EIDL_EID4                 3465
#define RXB0EID5                      3466
#define RXB0EIDL_EID5                 3467
#define RXB0EID6                      3468
#define RXB0EIDL_EID6                 3469
#define RXB0EID7                      3470
#define RXB0EIDL_EID7                 3471
#define RXB0DLC                       3472
#define RXB0DLC_DLC0                  3473
#define RXB0DLC0                      3474
#define RXB0DLC1                      3475
#define RXB0DLC_DLC1                  3476
#define RXB0DLC2                      3477
#define RXB0DLC_DLC2                  3478
#define RXB0DLC3                      3479
#define RXB0DLC_DLC3                  3480
#define RXB0RB0                       3481
#define RXB0DLC_RB0                   3482
#define RXB0DLC_RESRB0                3483
#define RXB0RB1                       3484
#define RXB0DLC_RB1                   3485
#define RXB0DLC_RESRB1                3486
#define RXB0DLC_RXRTR                 3487
#define RXB0RTR                       3488
#define RXB0D0                        3489
#define RXB0D00                       3490
#define RXB0D01                       3491
#define RXB0D02                       3492
#define RXB0D03                       3493
#define RXB0D04                       3494
#define RXB0D05                       3495
#define RXB0D06                       3496
#define RXB0D07                       3497
#define RXB0D1                        3498
#define RXB0D10                       3499
#define RXB0D11                       3500
#define RXB0D12                       3501
#define RXB0D13                       3502
#define RXB0D14                       3503
#define RXB0D15                       3504
#define RXB0D16                       3505
#define RXB0D17                       3506
#define RXB0D2                        3507
#define RXB0D20                       3508
#define RXB0D21                       3509
#define RXB0D22                       3510
#define RXB0D23                       3511
#define RXB0D24                       3512
#define RXB0D25                       3513
#define RXB0D26                       3514
#define RXB0D27                       3515
#define RXB0D3                        3516
#define RXB0D30                       3517
#define RXB0D31                       3518
#define RXB0D32                       3519
#define RXB0D33                       3520
#define RXB0D34                       3521
#define RXB0D35                       3522
#define RXB0D36                       3523
#define RXB0D37                       3524
#define RXB0D4                        3525
#define RXB0D40                       3526
#define RXB0D41                       3527
#define RXB0D42                       3528
#define RXB0D43                       3529
#define RXB0D44                       3530
#define RXB0D45                       3531
#define RXB0D46                       3532
#define RXB0D47                       3533
#define RXB0D5                        3534
#define RXB0D50                       3535
#define RXB0D51                       3536
#define RXB0D52                       3537
#define RXB0D53                       3538
#define RXB0D54                       3539
#define RXB0D55                       3540
#define RXB0D56                       3541
#define RXB0D57                       3542
#define RXB0D6                        3543
#define RXB0D60                       3544
#define RXB0D61                       3545
#define RXB0D62                       3546
#define RXB0D63                       3547
#define RXB0D64                       3548
#define RXB0D65                       3549
#define RXB0D66                       3550
#define RXB0D67                       3551
#define RXB0D7                        3552
#define RXB0D70                       3553
#define RXB0D71                       3554
#define RXB0D72                       3555
#define RXB0D73                       3556
#define RXB0D74                       3557
#define RXB0D75                       3558
#define RXB0D76                       3559
#define RXB0D77                       3560
#define CANSTAT                       3561
#define CANSTAT_EICODE0               3562
#define EICODE1                       3563
#define CANSTAT_EICODE1_ICODE0        3564
#define ICODE0                        3565
#define EICODE2                       3566
#define ICODE1                        3567
#define CANSTAT_EICODE2_ICODE1        3568
#define EICODE3                       3569
#define CANSTAT_EICODE3_ICODE2        3570
#define ICODE2                        3571
#define CANSTAT_EICODE4               3572
#define CANSTAT_OPMODE0               3573
#define CANSTAT_OPMODE1               3574
#define CANSTAT_OPMODE2               3575
#define CANCON                        3576
#define CANCON_FP0                    3577
#define WIN0                          3578
#define FP1                           3579
#define CANCON_WIN0_FP1               3580
#define WIN1                          3581
#define CANCON_WIN1_FP2               3582
#define FP2                           3583
#define FP3                           3584
#define CANCON_WIN2_FP3               3585
#define WIN2                          3586
#define CANCON_ABAT                   3587
#define CANCON_REQOP0                 3588
#define CANCON_REQOP1                 3589
#define CANCON_REQOP2                 3590
#define BRGCON1                       3591
#define BRP0                          3592
#define BRP1                          3593
#define BRP2                          3594
#define BRP3                          3595
#define BRP4                          3596
#define BRP5                          3597
#define SJW0                          3598
#define SJW1                          3599
#define BRGCON2                       3600
#define PRSEG0                        3601
#define PRSEG1                        3602
#define PRSEG2                        3603
#define SEG1PH0                       3604
#define SEG1PH1                       3605
#define SEG1PH2                       3606
#define SAM                           3607
#define SEG2PHT                       3608
#define SEG2PHTS                      3609
#define BRGCON3                       3610
#define SEG2PH0                       3611
#define SEG2PH1                       3612
#define SEG2PH2                       3613
#define WAKFIL                        3614
#define WAKDIS                        3615
#define CIOCON                        3616
#define CANCAP                        3617
#define ENDRHI                        3618
#define TX2EN                         3619
#define TX2SRC                        3620
#define COMSTAT                       3621
#define EWARN                         3622
#define RXWARN                        3623
#define TXWARN                        3624
#define RXBP                          3625
#define TXBP                          3626
#define TXBO                          3627
#define RXBNOVFL                      3628
#define RXB1OVFL                      3629
#define RXBnOVFL                      3630
#define RXB0OVFL_nFIFOEMPTY           3631
#define RXB0OVFL_NOT_FIFOEMPTY        3632
#define FIFOEMPTY                     3633
#define RXB0OVFL                      3634
#define NOT_FIFOEMPTY                 3635
#define nFIFOEMPTY                    3636
#define RXERRCNT                      3637
#define REC0                          3638
#define REC1                          3639
#define REC2                          3640
#define REC3                          3641
#define REC4                          3642
#define REC5                          3643
#define REC6                          3644
#define REC7                          3645
#define TXERRCNT                      3646
#define TEC0                          3647
#define TEC1                          3648
#define TEC2                          3649
#define TEC3                          3650
#define TEC4                          3651
#define TEC5                          3652
#define TEC6                          3653
#define TEC7                          3654
#define ECANCON                       3655
#define EWIN0                         3656
#define EWIN1                         3657
#define EWIN2                         3658
#define EWIN3                         3659
#define EWIN4                         3660
#define FIFOWM                        3661
#define F                             3662
#define MDSEL0                        3663
#define MDSEL1                        3664
#define ECCP1DEL                      3665
#define PDC0                          3666
#define PDC                           3667
#define PDC1                          3668
#define PDC2                          3669
#define PDC3                          3670
#define PDC4                          3671
#define PDC5                          3672
#define PDC6                          3673
#define PRSEN                         3674
#define BAUDCON                       3675
#define ABDEN                         3676
#define W4E                           3677
#define WUE                           3678
#define BRG16                         3679
#define SCKP                          3680
#define RCIDL                         3681
#define PORTA                         3682
#define AN0                           3683
#define PORTA_RA0                     3684
#define ULPWUIN                       3685
#define AN1                           3686
#define PORTA_RA1                     3687
#define AN2                           3688
#define PORTA_RA2                     3689
#define VREFM                         3690
#define AN3                           3691
#define PORTA_RA3                     3692
#define VREFP                         3693
#define PORTA_RA4                     3694
#define T0CKI                         3695
#define AN4                           3696
#define PORTA_RA5                     3697
#define LVDIN                         3698
#define CLKO                          3699
#define PORTA_RA6                     3700
#define OSC2                          3701
#define PORTB                         3702
#define INT0                          3703
#define PORTB_RB0                     3704
#define INT1                          3705
#define PORTB_RB1                     3706
#define INT2                          3707
#define PORTB_RB2                     3708
#define INT3                          3709
#define CCP2_PA2                      3710
#define PORTB_RB3                     3711
#define KBI0                          3712
#define PORTB_RB4                     3713
#define PGM                           3714
#define KBI1                          3715
#define PORTB_RB5                     3716
#define PGC                           3717
#define KBI2                          3718
#define PORTB_RB6                     3719
#define PGD                           3720
#define KBI3                          3721
#define PORTB_RB7                     3722
#define PORTC                         3723
#define T13CKI                        3724
#define T1OSO                         3725
#define PORTC_RC0                     3726
#define CCP2                          3727
#define T1OSI                         3728
#define PA2                           3729
#define PORTC_RC1                     3730
#define CCP1                          3731
#define P1A                           3732
#define PA1                           3733
#define PORTC_RC2                     3734
#define SCL                           3735
#define SCK                           3736
#define PORTC_RC3                     3737
#define SDA                           3738
#define SDI                           3739
#define PORTC_RC4                     3740
#define SDO                           3741
#define PORTC_RC5                     3742
#define TX                            3743
#define CK                            3744
#define PORTC_RC6                     3745
#define DT                            3746
#define RX                            3747
#define PORTC_RC7                     3748
#define PORTD                         3749
#define PSP0                          3750
#define PORTD_RD0                     3751
#define AD0                           3752
#define PSP1                          3753
#define PORTD_RD1                     3754
#define AD1                           3755
#define PSP2                          3756
#define AD2                           3757
#define PORTD_RD2                     3758
#define PSP3                          3759
#define AD3                           3760
#define PORTD_RD3                     3761
#define PORTD_RD4                     3762
#define PSP4                          3763
#define AD4                           3764
#define PSP5                          3765
#define AD5                           3766
#define PORTD_RD5                     3767
#define PSP6                          3768
#define AD6                           3769
#define PORTD_RD6                     3770
#define SS2                           3771
#define PSP7                          3772
#define AD7                           3773
#define PORTD_RD7                     3774
#define PORTE                         3775
#define PORTE_RD                      3776
#define PD2                           3777
#define AD8                           3778
#define RDE                           3779
#define PORTE_RE0                     3780
#define AD9                           3781
#define PORTE_WR                      3782
#define WRE                           3783
#define PORTE_RE1                     3784
#define PC2                           3785
#define CS                            3786
#define CCP10                         3787
#define PB2                           3788
#define PORTE_RE2                     3789
#define AD10                          3790
#define PORTE_RE3                     3791
#define CCP9E                         3792
#define AD11                          3793
#define PC3E                          3794
#define PORTE_RE4                     3795
#define PB3E                          3796
#define AD12                          3797
#define CCP8E                         3798
#define PORTE_RE5                     3799
#define CCP7E                         3800
#define AD13                          3801
#define PC1E                          3802
#define CCP6E                         3803
#define PORTE_RE6                     3804
#define AD14                          3805
#define PB1E                          3806
#define CCP2E                         3807
#define PA2E                          3808
#define PORTE_RE7                     3809
#define AD15                          3810
#define PORTF                         3811
#define PORTF_RF0                     3812
#define AN5                           3813
#define PORTF_RF1                     3814
#define C2OUTF                        3815
#define AN6                           3816
#define PORTF_RF2                     3817
#define AN7                           3818
#define C1OUTF                        3819
#define PORTF_RF3                     3820
#define AN8                           3821
#define PORTF_RF4                     3822
#define AN9                           3823
#define PORTF_RF5                     3824
#define AN10                          3825
#define CVREFF                        3826
#define PORTF_RF6                     3827
#define AN11                          3828
#define PORTF_RF7                     3829
#define SS                            3830
#define PORTG                         3831
#define CANTX1                        3832
#define PORTG_RG0                     3833
#define PORTG_RG1                     3834
#define C3OUTG                        3835
#define CANTX2                        3836
#define CANRX                         3837
#define PORTG_RG2                     3838
#define PORTG_RG3                     3839
#define P1D                           3840
#define PORTG_RG4                     3841
#define RG5                           3842
#define MCLR                          3843
#define RJPU                          3844
#define PORTH                         3845
#define PORTH_RH0                     3846
#define AD16                          3847
#define PORTH_RH1                     3848
#define AD17                          3849
#define PORTH_RH2                     3850
#define AD18                          3851
#define PORTH_RH3                     3852
#define AD19                          3853
#define PORTH_RH4                     3854
#define CCP9                          3855
#define PC3                           3856
#define AN12                          3857
#define PORTH_RH5                     3858
#define CCP8                          3859
#define PB3                           3860
#define AN13                          3861
#define PORTH_RH6                     3862
#define CCP7                          3863
#define PC1                           3864
#define AN14                          3865
#define PORTH_RH7                     3866
#define CCP6                          3867
#define PB1                           3868
#define AN15                          3869
#define PORTJ                         3870
#define ALE                           3871
#define PORTJ_RJ0                     3872
#define OE                            3873
#define PORTJ_RJ1                     3874
#define WRL                           3875
#define PORTJ_RJ2                     3876
#define WRH                           3877
#define PORTJ_RJ3                     3878
#define BA0                           3879
#define PORTJ_RJ4                     3880
