tiborsimon/embedded-tdd-headers/pic/pic18/pic18f8680_tdd.h
#define DONE                          4439
#define GO_NOT_DONE                   4440
#define GO                            4441
#define CHS0                          4442
#define CHS                           4443
#define CHS1                          4444
#define CHS2                          4445
#define CHS3                          4446
#define SSPCON2                       4447
#define SEN                           4448
#define RSEN                          4449
#define PEN                           4450
#define RCEN                          4451
#define ACKEN                         4452
#define ACKDT                         4453
#define ACKSTAT                       4454
#define GCEN                          4455
#define SSPCON1                       4456
#define SSPM0                         4457
#define SSPM                          4458
#define SSPM1                         4459
#define SSPM2                         4460
#define SSPM3                         4461
#define CKP                           4462
#define SSPEN                         4463
#define SSPOV                         4464
#define WCOL                          4465
#define SSPSTAT                       4466
#define BF                            4467
#define UA                            4468
#define R_NOT_W                       4469
#define READ_WRITE                    4470
#define NOT_W                         4471
#define R_W                           4472
#define nW                            4473
#define RW                            4474
#define nWRITE                        4475
#define R                             4476
#define NOT_WRITE                     4477
#define R_nW                          4478
#define I2C_READ                      4479
#define START                         4480
#define S                             4481
#define I2C_START                     4482
#define STOP                          4483
#define I2C_STOP                      4484
#define P                             4485
#define NOT_A                         4486
#define DATA_ADDRESS                  4487
#define nA                            4488
#define D_A                           4489
#define D_nA                          4490
#define D                             4491
#define DA                            4492
#define D_NOT_A                       4493
#define NOT_ADDRESS                   4494
#define nADDRESS                      4495
#define I2C_DAT                       4496
#define CKE                           4497
#define SMP                           4498
#define T2CON                         4499
#define T2CKPS0                       4500
#define T2CKPS                        4501
#define T2CKPS1                       4502
#define TMR2ON                        4503
#define T2OUTPS0                      4504
#define TOUTPS                        4505
#define T2OUTPS1                      4506
#define T2OUTPS2                      4507
#define T2OUTPS3                      4508
#define T1CON                         4509
#define TMR1ON                        4510
#define TMR1CS                        4511
#define NOT_T1SYNC                    4512
#define T1SYNC                        4513
#define nT1SYNC                       4514
#define T1INSYNC                      4515
#define T1OSCEN                       4516
#define SOSCEN                        4517
#define T1CKPS0                       4518
#define T1CKPS                        4519
#define T1CKPS1                       4520
#define T1RD16                        4521
#define T1CON_RD16                    4522
#define RCON                          4523
#define BOR                           4524
#define NOT_BOR                       4525
#define nBOR                          4526
#define POR                           4527
#define nPOR                          4528
#define NOT_POR                       4529
#define nPD                           4530
#define NOT_PD                        4531
#define PD                            4532
#define NOT_TO                        4533
#define nTO                           4534
#define TO                            4535
#define nRI                           4536
#define NOT_RI                        4537
#define RI                            4538
#define nIPEN                         4539
#define IPEN                          4540
#define NOT_IPEN                      4541
#define WDTCON                        4542
#define SWDTE                         4543
#define SWDTEN                        4544
#define LVDCON                        4545
#define LVV0                          4546
#define LVDL0                         4547
#define LVDL                          4548
#define LVV1                          4549
#define LVDL1                         4550
#define LVV2                          4551
#define LVDL2                         4552
#define LVV3                          4553
#define LVDL3                         4554
#define LVDEN                         4555
#define BGST                          4556
#define IRVST                         4557
#define OSCCON                        4558
#define SCS0                          4559
#define SCS                           4560
#define SCS1                          4561
#define PLLEN                         4562
#define LOCK                          4563
#define T0CON                         4564
#define T0PS                          4565
#define T0PS0                         4566
#define T0PS1                         4567
#define T0PS2                         4568
#define PSA                           4569
#define T0SE                          4570
#define T0CS                          4571
#define T08BIT                        4572
#define TMR0ON                        4573
#define STATUS                        4574
#define C                             4575
#define CARRY                         4576
#define DC                            4577
#define ZERO                          4578
#define Z                             4579
#define OV                            4580
#define OVERFLOW                      4581
#define N                             4582
#define NEGATIVE                      4583
#define INTCON3                       4584
#define INT1IF                        4585
#define INT1F                         4586
#define INT2IF                        4587
#define INT2F                         4588
#define INT3F                         4589
#define INT3IF                        4590
#define INT1E                         4591
#define INT1IE                        4592
#define INT2IE                        4593
#define INT2E                         4594
#define INT3E                         4595
#define INT3IE                        4596
#define INT1P                         4597
#define INT1IP                        4598
#define INT2IP                        4599
#define INT2P                         4600
#define INTCON2                       4601
#define RBIP                          4602
#define INT3IP                        4603
#define INT3P                         4604
#define TMR0IP                        4605
#define T0IP                          4606
#define INTEDG3                       4607
#define INTEDG2                       4608
#define INTEDG1                       4609
#define INTEDG0                       4610
#define RBPU                          4611
#define NOT_RBPU                      4612
#define nRBPU                         4613
#define INTCON                        4614
#define RBIF                          4615
#define INT0F                         4616
#define INT0IF                        4617
#define T0IF                          4618
#define TMR0IF                        4619
#define RBIE                          4620
#define INT0E                         4621
#define INT0IE                        4622
#define T0IE                          4623
#define TMR0IE                        4624
#define PEIE                          4625
#define PEIE_GIEL                     4626
#define GIEL                          4627
#define GIE_GIEH                      4628
#define GIE                           4629
#define GIEH                          4630
#define STKPTR0                       4631
#define STKPTR                        4632
#define STKPTR1                       4633
#define STKPTR2                       4634
#define STKPTR3                       4635
#define STKPTR4                       4636
#define STKUNF                        4637
#define STKOVF                        4638
#define STKFUL                        4639

#endif // _PIC18F8680_H_
